In [1]:
import pandas as pd

In [2]:
# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charli'],
    'Math': [85, 78, 91],
    'Science': [79, 95, 87],
    'English': [88, 89, 95]
}

df = pd.DataFrame(data)
print(df)

     Name  Math  Science  English
0   Alice    85       79       88
1     Bob    78       95       89
2  Charli    91       87       95

In [4]:
df2 = df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

In [5]:
df2

     Name  Subject  Score
0   Alice     Math     85
1     Bob     Math     78
2  Charli     Math     91
3   Alice  Science     79
4     Bob  Science     95
5  Charli  Science     87
6   Alice  English     88
7     Bob  English     89
8  Charli  English     95

In [6]:
df2.pivot(index="Name", columns="Subject", values="Score")

Subject  English  Math  Science
Name
Alice         88    85       79
Bob           89    78       95
Charli        95    91       87